Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect (OIDC) Bearer token authentication]
ja_jp: xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect (OIDC) ベアラートークン認証]

source: xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect bearer access token authentication].
ja_jp: xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect ベアラートークン認証]。

source: xref:security-oidc-bearer-token-authentication.adoc[Quarkus OpenID Connect (OIDC) Bearer token authentication]
ja_jp: xref:security-oidc-bearer-token-authentication.adoc[Quarkus OpenID Connect (OIDC) ベアラートークン認証]

source: xref:security-oidc-code-flow-authentication-tutorial.adoc[Protect a web application by using OIDC authorization code flow]
ja_jp: xref:security-oidc-code-flow-authentication-tutorial.adoc[OIDC認可コードフローを使用したWebアプリケーション保護]

source: xref:security-oidc-code-flow-authentication.adoc#oidc-saml-broker[OpenID Connect (OIDC) Authorization Code Flow and SAML Identity broker]
ja_jp: xref:security-oidc-code-flow-authentication.adoc#oidc-saml-broker[OpenID Connect (OIDC) 認可コードフローと SAML アイデンティティーブローカー]

source: xref:security-oidc-code-flow-authentication.adoc[OIDC Authorization code flow authentication]
ja_jp: xref:security-oidc-code-flow-authentication.adoc[OIDC 認可コードフロー認証]

source: xref:security-oidc-code-flow-authentication.adoc[OIDC Code Flow], xref:form-auth[Form-based authentication]
ja_jp: xref:security-oidc-code-flow-authentication.adoc[OIDCコードフロー] 、 xref:form-auth[フォームベース認証]

source: xref:security-oidc-code-flow-authentication.adoc[OIDC code flow mechanism for protecting web applications]
ja_jp: xref:security-oidc-code-flow-authentication.adoc[ウェブアプリケーションを保護する OIDC コードフローメカニズム]

source: xref:security-oidc-code-flow-authentication.adoc[OpenID Connect (OIDC) Authorization Code Flow mechanism]
ja_jp: xref:security-oidc-code-flow-authentication.adoc[OpenID Connect (OIDC) 認可コードフローメカニズム]

source: xref:security-oidc-code-flow-authentication.adoc[OpenID Connect authorization code flow authentication].
ja_jp: xref:security-oidc-code-flow-authentication.adoc[OpenID Connect 認可コードフロー認証]。

source: xref:security-oidc-code-flow-authentication.adoc[Quarkus OpenID Connect Authorization code flow mechanism for protecting web applications]
ja_jp: xref:security-oidc-code-flow-authentication.adoc[Web アプリケーションの保護に使用する Quarkus OpenID Connect 認可コードフローメカニズム]

source: xref:security-oidc-configuration-properties-reference.adoc[Generated OIDC Configuration]
ja_jp: xref:security-oidc-configuration-properties-reference.adoc[生成された OIDC 設定]

source: xref:security-oidc-configuration-properties-reference.adoc[OIDC configuration properties]
ja_jp: xref:security-oidc-configuration-properties-reference.adoc[OIDC 設定プロパティー]

source: xref:security-oidc-expanded-configuration.adoc[Expanded OIDC Configuration Reference]
ja_jp: xref:security-oidc-expanded-configuration.adoc[詳細な OIDC 設定リファレンス]

source: xref:security-openid-connect-client-reference.adoc#quarkus-oidc-client-graphql[Integrating OIDC clients into GraphQL clients]
ja_jp: xref:security-openid-connect-client-reference.adoc#quarkus-oidc-client-graphql[OIDCクライアントのGraphQLクライアントへの統合]

source: xref:security-openid-connect-client-reference.adoc[OpenID Connect Client and Token Propagation Reference Guide]
ja_jp: xref:security-openid-connect-client-reference.adoc[OpenID Connect Client と Token Propagation のリファレンスガイド]

source: xref:security-openid-connect-client-reference.adoc[OpenID Connect and OAuth2 Client and Filters reference guide]
ja_jp: xref:security-openid-connect-client-reference.adoc[OpenID Connect および OAuth2 クライアントとフィルターのリファレンスガイド]

source: xref:security-openid-connect-client-reference.adoc[OpenID Connect and OAuth2 client and filters reference guide]
ja_jp: xref:security-openid-connect-client-reference.adoc[OpenID Connect および OAuth2 クライアントとフィルターのリファレンスガイド]

source: xref:security-openid-connect-client.adoc[OpenID Connect Client and Token Propagation Quickstart]
ja_jp: xref:security-openid-connect-client.adoc[OpenID Connectクライアントとトークンの伝搬クイックスタート]

source: xref:security-openid-connect-client.adoc[OpenID Connect client and token propagation quickstart].
ja_jp: xref:security-openid-connect-client.adoc[OpenID Connect クライアントとトークンの伝搬クイックスタート]

source: xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] is recommended for the integration testing against Keycloak. Dev Services for Keycloak launches and initializes a test container: it imports configured realms and sets a base Keycloak URL for the `CustomTenantResolver` to calculate a realm-specific URL.
ja_jp: Keycloak に対するインテグレーションテストには、xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] が推奨されます。 Dev Services for Keycloak は、テストコンテナーを起動して初期化します。設定されたレルムをインポートし、`CustomTenantResolver` のベース Keycloak URL を設定して、レルム固有の URL を計算します。

source: xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] launches a Keycloak container and imports `quarkus-realm.json`.
ja_jp: xref:security-openid-connect-dev-services.adoc[Keycloak の Dev Services] は Keycloak コンテナーを起動し、 `quarkus-realm.json` をインポートします。

source: xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] starts a Keycloak container and imports the `quarkus-realm.json` configuration file.
ja_jp: xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] は、Keycloak コンテナーを起動し、 `quarkus-realm.json` 設定ファイルをインポートします。

source: xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] will launch a Keycloak container and import a `quarkus-realm.json`.
ja_jp: xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] は、Keycloak コンテナーを起動し、 `quarkus-realm.json` をインポートします。

source: xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] will start a Keycloak container and import a `quarkus-realm.json`.
ja_jp: xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] は、Keycloak コンテナーを起動し、`quarkus-realm.json` をインポートします。

source: xref:security-openid-connect-multitenancy.adoc#programmatic-startup[Programmatic OIDC start-up for multitenant application]
ja_jp: xref:security-openid-connect-multitenancy.adoc#programmatic-startup[マルチテナントアプリケーションのプログラムによる OIDC 起動]

source: xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[Dynamic tenant configuration resolution] is currently not supported. Authentication that requires a dynamic tenant will fail.
ja_jp: xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[動的テナント設定解決] は現在サポートされていません。 動的テナントを必要とする認証は失敗します。

source: xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[OIDC TenantConfigResolver] can be used to create OIDC tenant configurations using the metadata of the registered clients.
ja_jp: xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[OIDC TenantConfigResolver] は、登録されたクライアントのメタデータを使用してOIDCテナントコンフィギュレーションを作成するために使用できます。

source: xref:security-openid-connect-multitenancy.adoc[OIDC MultiTenancy]
ja_jp: xref:security-openid-connect-multitenancy.adoc[OIDC マルチテナンシー]

source: xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect (OIDC) multi-tenancy]
ja_jp: xref:security-openid-connect-multitenancy.adoc[OpenID Connect (OIDC) マルチテナントの使用]

source: xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect Multi-Tenancy]
ja_jp: xref:security-openid-connect-multitenancy.adoc[OpenID Connect マルチテナンシーの使用]

source: xref:security-openid-connect-providers.adoc[Configuring well-known OpenID Connect Providers]
ja_jp: xref:security-openid-connect-providers.adoc[よく知られたOpenID Connectプロバイダの設定]

source: xref:security-openid-connect-providers.adoc[Configuring well-known OpenID Connect providers]
ja_jp: xref:security-openid-connect-providers.adoc[よく知られた OpenID Connect プロバイダーの設定]

source: xref:security-openid-connect-providers.adoc[Well Known OpenID Connect providers].
ja_jp: xref:security-openid-connect-providers.adoc[よく知られた OpenID Connect プロバイダー]

source: xref:security-openid-connect-web-authentication.adoc[OpenID Connect (OIDC) authorization code flow mechanism]
ja_jp: xref:security-openid-connect-web-authentication.adoc[OpenID Connect (OIDC)認可コードフローメカニズム]

source: xref:security-openid-connect-web-authentication.adoc[Quarkus - Using OpenID Connect to Protect Web Applications using Authorization Code Flow]
ja_jp: xref:security-openid-connect-web-authentication.adoc[Quarkus - OpenID Connect を使用した、認可コードフローによる Web アプリケーションの保護]

source: xref:security-openid-connect-web-authentication.adoc[Using OpenID Connect (OIDC) to Protect Web Applications using Authorization Code Flow ]
ja_jp: xref:security-openid-connect-web-authentication.adoc[Quarkus - OpenID Connect を使用した、認可コードフローによる Web アプリケーションの保護]

source: xref:security-openid-connect-web-authentication.adoc[Using OpenID Connect to Protect Web Application]
ja_jp: xref:security-openid-connect-web-authentication.adoc[OpenID Connectを利用したサービスアプリケーションの保護]

source: xref:security-openid-connect.adoc[Quarkus - Using OpenID Connect to Protect Service Applications using Bearer Token Authorization]
ja_jp: xref:security-openid-connect.adoc[Quarkus - OpenID Connect (OIDC) を使用した、ベアラートークン認可によるサービスアプリケーションの保護]

source: xref:security-openid-connect.adoc[Using OpenID Connect (OIDC) to Protect Service Applications using Bearer Token Authorization]
ja_jp: xref:security-openid-connect.adoc[Quarkus - OpenID Connect (OIDC) を使用した、ベアラートークン認可によるサービスアプリケーションの保護]

source: xref:security-openid-connect.adoc[Using OpenID Connect (OIDC) to protect service applications using Bearer Token authorization]
ja_jp: xref:security-openid-connect.adoc[OpenID Connect (OIDC) とベアラートークン認可を使用したサービスアプリケーションの保護]

source: xref:security-openid-connect.adoc[Using OpenID Connect to Protect Service Applications]
ja_jp: xref:security-openid-connect.adoc[OpenID Connect を使用したサービスアプリケーションの保護]

source: xref:security-overview-concept.adoc#identity-providers[Security Identity Providers]
ja_jp: xref:security-overview-concept.adoc#identity-providers[Securityアイデンティティ・プロバイダー]

source: xref:security-overview-concept.adoc#oidc-jwt-oauth2-comparison[Summary of Quarkus OIDC, JWT and OAuth2 features]
ja_jp: xref:security.adoc#oidc-jwt-oauth2-comparison[Quarkus OIDC、 JWT および OAuth2 機能のサマリー]

source: xref:security-overview-concept.adoc[Quarkus Security overview]
ja_jp: xref:security-overview-concept.adoc[Quarkus Security 概要]

source: xref:security-overview.adoc[Quarkus Security overview]
ja_jp: xref:security-overview.adoc[Quarkus Securityの概要]

source: xref:security-proactive-authentication.adoc[Proactive authentication]
ja_jp: xref:security-proactive-authentication.adoc[プロアクティブ認証]

source: xref:security-properties.adoc[Elytron security properties file extension `(quarkus-elytron-security-properties-file)`]
ja_jp: xref:security-properties.adoc[Elytron セキュリティープロパティーファイルエクステンション `(quarkus-elytron-security-properties-file)`]

source: xref:security-testing.adoc#configuring-user-information[Configuring User Information in application.properties]
ja_jp: また、「 link:security-testing.html#configuring-user-information[application.propertiesでユーザー情報を設定する]」も参照してください。

source: xref:security-vulnerability-detection.adoc[Security vulnerability detection and National Vulnerability Database (NVD) registration]
ja_jp: xref:security-vulnerability-detection.adoc[セキュリティ脆弱性の検出と国家脆弱性データベース（NVD）登録]

source: xref:security.adoc#identity-providers[Security Identity Providers]
ja_jp: 詳しくは「 link:security.html#identity-providers[Security Identity Providers]」をご覧ください。

source: xref:security.adoc[Security Architecture and Guides]
ja_jp: xref:security.adoc[セキュリティアーキテクチャとガイド]

source: xref:simplified-logging[Simplified logging]
ja_jp: xref:simplified-logging[簡易ロギング]

source: xref:smallrye-jwt-authentication[SmallRye JWT authentication]
ja_jp: xref:smallrye-jwt-authentication[SmallRye JWT認証]

source: xref:spring-boot-properties.adoc[Quarkus - Extension for Spring Boot properties]
ja_jp: xref:spring-boot-properties.adoc[Quarkus - Spring Boot プロパティーのエクステンション]

source: xref:spring-cache.adoc[Quarkus - Extension for Spring Cache]
ja_jp: xref:spring-cache.adoc[Quarkus - Spring Cache のエクステンション]

source: xref:spring-cloud-config-client.adoc[Quarkus - Reading properties from Spring Cloud Config Server]
ja_jp: xref:spring-cloud-config-client.adoc[Quarkus - Spring Cloud Config Serverからプロパティを読み込む]

source: xref:spring-data-jpa.adoc[Quarkus - Extension for Spring Data JPA]
ja_jp: xref:spring-data-jpa.adoc[Quarkus - Spring Data JPAのエクステンション]

source: xref:spring-data-rest.adoc[Quarkus - Extension for Spring Data REST]
ja_jp: xref:spring-data-rest.adoc[Quarkus - Spring Data RESTのエクステンション]

source: xref:spring-di.adoc[Quarkus - Extension for Spring DI]
ja_jp: xref:spring-di.adoc[Quarkus - Spring DI のエクステンション]

source: xref:spring-scheduled.adoc[Quarkus - Extension for Spring Scheduled]
ja_jp: xref:spring-scheduled.adoc[Quarkus - Spring Scheduled のエクステンション]

source: xref:spring-security.adoc[Quarkus - Extension for Spring Security]
ja_jp: xref:spring-security.adoc[Quarkus - Spring Securityのエクステンション]

source: xref:spring-web.adoc[Quarkus - Extension for Spring Web]
ja_jp: xref:spring-web.adoc[Quarkus - Spring Web のエクステンション]

source: xref:telemetry-micrometer.adoc#configuration-reference[Micrometer metrics configuration properties]
ja_jp: xref:telemetry-micrometer.adoc#configuration-reference[Micrometer メトリクス設定プロパティー]

source: xref:telemetry-micrometer.adoc[Micrometer] is capable of exposing metrics that Hibernate ORM collects at runtime. To enable exposure of Hibernate metrics on the `/q/metrics` endpoint, make sure your project depends on a metrics extension and set the configuration property `quarkus.hibernate-orm.metrics.enabled` to `true`.
ja_jp: xref:telemetry-micrometer.adoc[Micrometer] は、 Hibernate ORM が実行時に収集するメトリクスを公開できます。 `/q/metrics` エンドポイントで Hibernate メトリクスの公開を有効にするには、プロジェクトがメトリクスエクステンションに依存していることを確認し、設定プロパティー `quarkus.hibernate-orm.metrics.enabled` を `true` に設定してください。

source: xref:telemetry-micrometer.adoc[Micrometer] is the recommended approach to metrics for Quarkus. Use the SmallRye Metrics extension when it is required to retain MicroProfile specification compatibility.
ja_jp: Quarkusでは、 xref:telemetry-micrometer.adoc[Micrometer] を使用したメトリクスを推奨しています。MicroProfile仕様との互換性を保つために必要な場合は、SmallRye Metricsエクステンションを使用してください。

source: xref:template_data[`@TemplateData`] and xref:convenient-annotation-for-enums[`@TemplateEnum`] annotations are ignored.
ja_jp: xref:template_data[`@TemplateData`] と xref:convenient-annotation-for-enums[`@TemplateEnum`] アノテーションは無視されます。

source: xref:template_extension_methods[`@TemplateExtension` methods] will not work.
ja_jp: xref:template_extension_methods[`@TemplateExtension` のメソッド] は動作しません。

source: xref:type-safe-message-bundles[Type-safe message bundles] are not supported.
ja_jp: xref:type-safe-message-bundles[タイプセーフメッセージバンドル] には対応していません。

source: xref:typesafe_expressions[Type-safe Expressions] are not validated.
ja_jp: xref:typesafe_expressions[タイプセーフ式] はバリデーションされません。

source: xref:unproxyable_classes_transformation[Transformation of unproxyable classes]
ja_jp: xref:unproxyable_classes_transformation[プロキシ不可能なクラスの変換]

source: xref:webauthn-authentication[WebAuthn authentication]
ja_jp: xref:webauthn-authentication[WebAuthn 認証]

source: xref:writing-extensions.adoc[Guide to writing extensions]
ja_jp: xref:writing-extensions.adoc[エクステンション作成ガイド]

source: xref:writing-extensions.adoc[Writing your own extension] for the full documentation.
ja_jp: 完全なドキュメント: link:writing-extensions.html[独自のエクステンションを書く]

source: xref:writing-extensions.adoc[Writing your own extension] guide
ja_jp: xref:writing-extensions.adoc[独自のエクステンションの作成] ガイド

source: xref:xml-mapping[XML mapping] files are expected to have a unique path.
ja_jp: xref:xml-mapping[XMLマッピング] ファイルは、一意のパスを持つことが期待されます。

source: you can add a `src/main/resources/META-INF/quarkus-preload-classes.txt` file listing the classes to preload, such as:
ja_jp: 以下のように、プリロードするクラスをリストアップした `src/main/resources/META-INF/quarkus-preload-classes.txt` ファイルを追加することができます。

source: you can of course also use the generated metamodel accessors instead of injecting these repositories, with `Cat_.repo()` and `Cat_.theOtherRepo()`.
ja_jp: これらのリポジトリを注入する代わりに、`Cat_.repo()` と `Cat_.theOtherRepo()` を使用して、生成されたメタモデルアクセサーを使用することももちろん可能です。

source: you can place template extension methods in every class if you annotate them with `@TemplateExtension` but we advise to keep them either grouped by target type, or in a single `TemplateExtensions` class by convention.
ja_jp: テンプレート拡張メソッドは、 `@TemplateExtension` でアノテーションを付ければ、すべてのクラスに配置することができますが、規約上、ターゲットタイプでグループ化するか、 `TemplateExtensions` クラスにまとめておくことをお勧めします。

source: you can reference the files in the jar from your HTML, example `/_static/lit/3.1.2/index.js`.
ja_jp: HTML から jar 内のファイルを参照できます (例: `/_static/lit/3.1.2/index.js`)。

source: you can reference the files in the jar from your HTML, example `/webjars/jquery/3.1.1/jquery.min.js`.
ja_jp: HTML から jar 内のファイルを参照できます (例: `/webjars/jquery/3.1.1/jquery.min.js`)。

source: you can return different entity types depending on what happens in your method (a `Legume` or an `Error` for instance);
ja_jp: メソッドで何が起こるかによって異なるエンティティータイプを返すことができます (例えば `Legume` や `Error` )。

source: you can set the attributes of the `Response` (the status comes to mind in the case of an error).
ja_jp: `Response` の属性を設定することができます (エラーが発生した時にステータスを知ることができます):

source: you include the `quarkus-test-kubernetes-client` dependency
ja_jp: `quarkus-test-kubernetes-client` の依存関係を含めている場合

source: you will notice amongst the other files that are created, two files named `kubernetes.json` and `kubernetes.yml` in the `target/kubernetes/` directory.
ja_jp: 作成された他のファイルの中に `kubernetes.json` と `kubernetes.yml` という名前の 2 つのファイルが `target/kubernetes/` ディレクトリーにあることに気づくでしょう。

source: your JDBC driver extension (`quarkus-jdbc-postgresql`, `quarkus-jdbc-h2`, `quarkus-jdbc-mariadb`, ...)
ja_jp: お使いの JDBC ドライバーエクステンション ( `quarkus-jdbc-postgresql` , `quarkus-jdbc-h2` , `quarkus-jdbc-mariadb` , ...)

source: your JDBC driver extension; the following options are available:
ja_jp: JDBC ドライバーエクステンション。以下のオプションを使用できます:

source: your reactive driver extension (`quarkus-reactive-pg-client`, `quarkus-reactive-mysql-client`, `quarkus-reactive-db2-client`, ...)
ja_jp: お使いのリアクティブドライバのエクステンション ( `quarkus-reactive-pg-client` , `quarkus-reactive-mysql-client` , `quarkus-reactive-db2-client` , ... )

source: your selected filters
ja_jp: 選択されたフィルター

source: {openshift-long} is a Kubernetes-based platform for developing and running containerized applications. Quarkus offers the ability to automatically generate {openshift} resources based on sane defaults and user-supplied configuration.
ja_jp: {openshift-long}は、コンテナ化されたアプリケーションを開発および実行するためのKubernetesベースのプラットフォームです。 Quarkusは、正常なデフォルトとユーザーが提供する設定に基づいて{openshift}リソースを自動的に生成する機能を提供します。

source: {openshift} provides multiple ways of defining environment variables:
ja_jp: {openshift} は環境変数を定義する複数の方法を提供します：

source: {project-name} also includes built-in security to allow for role-based access control (RBAC) based on the common security annotations @RolesAllowed, @DenyAll, @PermitAll on REST endpoints and CDI beans. For more information, see the Quarkus xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints] guide.
ja_jp: {project-name} には、RESTエンドポイントやCDI Beanに共通のセキュリティアノテーション@RolesAllowed、@DenyAll、@PermitAllに基づくロールベースのアクセス制御（RBAC）を可能にするセキュリティも組み込まれています。 詳細については、Quarkus xref:security-authorize-web-endpoints-reference.adoc[ウェブエンドポイントの認可] ガイドを参照してください。

source: {project-name} also includes built-in security to allow for role-based access control (RBAC) based on the common security annotations @RolesAllowed, @DenyAll, @PermitAll on REST endpoints, and CDI beans. For more information, see the Quarkus xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints] guide.
ja_jp: また、{project-name}には、RESTエンドポイントやCDI Beanに共通のセキュリティアノテーション@RolesAllowed、@DenyAll、@PermitAllに基づくロールベースのアクセス制御（RBAC）を可能にするセキュリティが組み込まれています。 詳細については、 xref:security-authorize-web-endpoints-reference.adoc[Webエンドポイントの認可] を参照してください。

source: {project-name} also includes built-in security to allow for role-based access control (RBAC) based on the common security annotations `@RolesAllowed`, `@DenyAll`, `@PermitAll` on REST endpoints and CDI beans. For more information, see the Quarkus xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints] guide.
ja_jp: また、{project-name} には、REST エンドポイントや CDI Bean に共通のセキュリティ注釈 `@RolesAllowed` 、 `@DenyAll` 、 `@PermitAll` に基づく役割ベースのアクセス制御（RBAC）を可能にするセキュリティが組み込まれています。 詳細については、Quarkus xref:security-authorize-web-endpoints-reference.adoc[ウェブエンドポイントの認可] ガイドを参照してください。

source: {project-name} also includes built-in security to allow for role-based access control (RBAC) based on the common security annotations `@RolesAllowed`, `@DenyAll`, `@PermitAll` on REST endpoints, and Contexts and Dependency Injection (CDI) beans. For more information, see the Quarkus xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints] guide.
ja_jp: {project-name} また、REST エンドポイントの一般的なセキュリティーアノテーション `@RolesAllowed`、 `@DenyAll`、 `@PermitAll` と、コンテキストと依存性注入 (CDI) Bean に基づくロールベースのアクセス制御 (RBAC) を可能にする組み込みのセキュリティーも含まれています。 詳細は、Quarkus xref:security-authorize-web-endpoints-reference.adoc[Web エンドポイントの認可] ガイドを参照してください。

source: {project-name} annotation types summary
ja_jp: {project-name} アノテーションの種類の概要

source: {project-name} includes built-in security to allow for link:https://en.wikipedia.org/wiki/Role-based_access_control[Role-Based Access Control (RBAC)] based on the common security annotations `@RolesAllowed`, `@DenyAll`, `@PermitAll` on REST endpoints and CDI beans.
ja_jp: {project-name} には、REST エンドポイントと CDI Bean 上の共通セキュリティーアノテーション `@RolesAllowed`、 `@DenyAll`、 `@PermitAll` に基づく link:https://en.wikipedia.org/wiki/Role-based_access_control[Role-Based Access Control (RBAC)] を可能にするセキュリティーが組み込まれています。

source: {project-name} policies summary
ja_jp: {project-name} ポリシーの概要

source: {project-name} provides different log levels, which helps developers to control the amount of information logged based on the severity of the events.
ja_jp: {project-name} にはさまざまなログレベルが用意されており、開発者はイベントの重大性に基づいてログに記録される情報量を制御できます。

source: {project-name} provides multiple log levels to control the amount of information logged based on event severity.
ja_jp: {project-name} は、イベントの重要性に基づいてログに記録される情報の量を制御するために、複数のログレベルを提供します。

source: {project-name} provides the `io.quarkus.security.Authenticated` annotation that permits any authenticated user to access the resource. It's equivalent to `@RolesAllowed("**")`.
ja_jp: {project-name} は、認証されたすべてのユーザーがリソースにアクセスできるようにする `io.quarkus.security.Authenticated` アノテーションを提供します。これは `@RolesAllowed ("**")` と同等です。

source: {project-name} recognizes both `.yaml` and `.yml` file extensions. If both files are available, {project-name} gives precedence to the `.yaml` file and then the `.yml` file.
ja_jp: {project-name} は、`.yaml` と `.yml` の両方のファイル拡張子を認識します。両方のファイルが利用可能な場合、{project-name} は `.yaml` ファイルを優先し、次に `.yml` ファイルを優先します。

source: {project-name} recognizes both `.yml` and `.yaml` file extensions.
ja_jp: {project-name}は、 `.yml` と `.yaml` の両方のファイル拡張子を認識します。

source: {project-name} relies on the JBoss Logging library for all the logging requirements.
ja_jp: {project-name} は、すべてのロギング要件を JBoss Logging ライブラリーに依存しています。
